<?php
/**
 * @author    ZhengYiBin<zhengyb@pvc123.com>
 * @date      2020-08-11 下午3:05
 * @function  基础数据类，可从数据库获取
 */

namespace app\api\dateLeave;


class MyData {

    // 假期
    public static $holiday1 = [
        "2020-01-01", // 元旦

        "2020-02-24", // 春节
        "2020-02-25", // 春节
        "2020-02-26", // 春节
        "2020-02-27", // 春节
        "2020-02-28", // 春节
        "2020-02-29", // 春节
        "2020-02-30", // 春节

        "2020-04-04", // 清明节
        "2020-04-05", // 清明节
        "2020-04-06", // 清明节

        "2020-05-01", // 劳动节
        "2020-05-02", // 劳动节
        "2020-05-03", // 劳动节
        "2020-05-04", // 劳动节
        "2020-05-05", // 劳动节

        "2020-10-01", // 国庆节
        "2020-10-02", // 国庆节
        "2020-10-03", // 国庆节
        "2020-10-04", // 国庆节
        "2020-10-05", // 国庆节
        "2020-10-06", // 国庆节
        "2020-10-07", // 国庆节
        "2020-10-08", // 国庆节

        "2021-01-01" // 元旦
    ];

    // 调休
    public static $holiday2 = [

        "2020-01-19", // 春节_调休
        "2020-02-01", // 春节_调休

        //"2020-04-08", // 清明_节调休

        "2020-04-26", // 劳动_节调休
        "2020-05-09", // 劳动_节调休

        "2020-06-28", // 端午节_节调休

        "2020-09-27", // 国庆节_调休
        "2020-10-10", // 国庆节_调休

        //"2020-12-29"  // 元旦_调休
    ];

    // 作息时间1
    public static $workTime1 = [
        "08:30", // 上午上班时间
        "12:00", // 上午下班时间
        "13:30", // 下午上班时间
        "18:00"  // 下午下班时间
    ];

    // 作息时间2
    public static $workTime2 = [

        "09:00", // 上午上班时间
        "12:00", // 上午下班时间
        "13:00", // 下午上班时间
        "18:00"  // 下午下班时间
    ];
}